backend/app/controllers/api/v1/articles_controller.rb

INSERT INTO "articles" ("title", "content", "user_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["title", "Codementor"], ["content", "It's the best"], ["user_id", 1], ["created_at", "2020-08-16 21:36:59.702289"], ["updated_at", "2020-08-16 21:36:59.702289"]]
---
    def create
      @article = @current_user.articles.create(article_params)

SELECT "articles".* FROM "articles" WHERE "articles"."id" = $1  [["id", 2]]
---
    def show
      @article = Article.where(id: params[:id])

SELECT "articles".* FROM "articles" WHERE "articles"."user_id" = $1 AND "articles"."id" = $2 LIMIT $3  [["user_id", 1], ["id", 2], ["LIMIT", 1]]
DELETE FROM "articles" WHERE "articles"."id" = $1  [["id", 2]]
---
    def destroy
      @article = @current_user.articles.find(params[:id])
      @article.destroy