backend/app/controllers/api/v1/comments_controller.rb

SELECT "articles".* FROM "articles" WHERE "articles"."id" = $1 ORDER BY "articles"."id" ASC LIMIT $2  [["id", 2], ["LIMIT", 1]]
INSERT INTO "comments" ("user_id", "article_id", "content", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["user_id", 1], ["article_id", 2], ["content", "this is a comment"], ["created_at", "2020-08-16 21:37:11.131010"], ["updated_at", "2020-08-16 21:37:11.131010"]]
---
    def create
      @article = Article.where(id: params[:article_id]).first
      if @article.comments.create(comments_params)

SELECT "comments".* FROM "comments" WHERE "comments"."article_id" = $1  [["article_id", 1]]
---
    def show
      @article = Article.where(id: params[:article_id]).first
      @comment = @article.comments.where(id: params[:id]).first