backend/app/controllers/api/v1/users_controller.rb

UPDATE "users" SET "lastname" = $1, "updated_at" = $2 WHERE "users"."id" = $3  [["lastname", "Jones"], ["updated_at", "2020-08-18 21:22:42.720479"], ["id", 1]]
---
    def update
      if @current_user.update(user_params)